#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
aws_route53_zone.main: Refreshing state... [id=Z03891131G981LPL0YNZ0]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/flask-cluster/cluster]
aws_ecr_repository.ecr: Refreshing state... [id=flask]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
data.aws_ami.amazon-linux-2023: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ed95982595adbe23]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20240124124607773500000002]
data.aws_caller_identity.current: Read complete after 0s [id=478282223251]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=flask-cluster-cluster-20240124124607774300000003]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=478282223251]
aws_iam_role.role2: Refreshing state... [id=eks-role]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=478282223251]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=478282223251]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::478282223251:assumed-role/gha_oidc_assume_role/terraformdeploy]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20240124124607773500000002-20240124124608143800000006]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20240124124607773500000002-20240124124608103500000004]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20240124124607773500000002-20240124124608135900000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=flask-cluster-cluster-20240124124607774300000003-20240124124608214800000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=flask-cluster-cluster-20240124124607774300000003-20240124124608212800000007]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2291170236]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=629ac59e-2ebc-414f-b129-35a47f1df8a9]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/flask-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::478282223251:policy/flask-cluster-cluster-ClusterEncryption2024012412462509720000000b]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=flask-cluster-cluster-20240124124607774300000003-2024012412462534030000000c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-067278553c4dc708f]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-09b0061580ee0fee4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-048f428bb6eb666ee]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07d94a09849de2d7d]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0c06248aefc81afe4]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-074fd47f42d774a42]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0373896a11d2d3f00]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03108c904ac12644d]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0cf6a3a48c73547f2]
data.aws_ami.amazon-linux-2023: Read complete after 0s [id=ami-0bb6cbb99aec63c04]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d8dff343e52771e7]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-07957e6f310ba79ba]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0641bd5a166ca8725]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ff12dc8820987dd4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0324c3020d5e78194]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0871d0a38d2fec8f0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-061c88874d84e10c2]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0bf4d2cf140218176]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-04f3d35c66ed7125e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01c6b7dbd61401fb8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0373896a11d2d3f001080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03700b35947d4e19a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07d4832a4376cdec4]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08b7c4d0d896c350f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f604d2b4bcc24456]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-041213f0fd82c295c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0145c15defc4ae7ea]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-127418426]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1586481691]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1741853828]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1428463314]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-584683832]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3952866990]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-4207962612]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-830844185]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3491543256]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4116030326]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3080960987]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ba9dea08a7cc36e1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ec67d39d38901238]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0ee8bc235cf47288f]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d8dff343e52771e71080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-07957e6f310ba79ba1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0641bd5a166ca87251080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=flask-cluster]
data.aws_eks_cluster_auth.default: Reading...
module.eks.aws_eks_identity_provider_config.this["sts"]: Refreshing state... [id=flask-cluster:sts]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=flask-cluster]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-01-24T12:57:37Z]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::478282223251:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-04853ea5dbad3cf6d]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=flask-cluster:general-20240124125737730400000013]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=flask-cluster:coredns]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=flask-cluster:vpc-cni]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=flask-cluster:kube-proxy]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::478282223251:policy/AmazonEKS_Cert_Manager_Policy-20240124130418963800000019]
module.cert_manager_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager]
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::478282223251:policy/AmazonEKS_External_DNS_Policy-20240124130418960500000018]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns]
module.cert_manager_irsa_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager-2024012413041925940000001b]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns-2024012413041923490000001a]
kubernetes_service_account.cert-account: Refreshing state... [id=kube-system/cert-manager]
kubernetes_service_account.dns-account: Refreshing state... [id=kube-system/external-dns]
helm_release.cert-manager: Refreshing state... [id=cert-manager]
helm_release.external_dns: Refreshing state... [id=external-dns]
helm_release.nginx-ingress: Refreshing state... [id=nginx-ingress-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.role2 will be updated in-place
  ~ resource "aws_iam_role" "role2" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::478282223251:root" -> "arn:aws:iam::478282223251:user/cloud_user"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-role"
        name                  = "eks-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.cert_manager_irsa_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cert_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:GetChange",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z03891131G981LPL0YNZ0",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ListHostedZonesByName",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cert-manager",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::478282223251:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert_manager_irsa_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.cert_manager_irsa_role.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0] will be updated in-place
  ~ resource "aws_iam_policy" "cert_manager" {
        id          = "arn:aws:iam::478282223251:policy/AmazonEKS_Cert_Manager_Policy-20240124130418963800000019"
        name        = "AmazonEKS_Cert_Manager_Policy-20240124130418963800000019"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:GetChange"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::change/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z03891131G981LPL0YNZ0"
                    },
                  - {
                      - Action   = "route53:ListHostedZonesByName"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.cert_manager_irsa_role.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:sub" = "system:serviceaccount:kube-system:cert-manager"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::478282223251:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cert-manager"
        name                  = "cert-manager"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.external_dns_irsa_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "external_dns" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z03891131G981LPL0YNZ0",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ListHostedZones",
              + "route53:ListResourceRecordSets",
              + "route53:ListTagsForResource",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.external_dns_irsa_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:external-dns",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::478282223251:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.external_dns_irsa_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.external_dns_irsa_role.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.external_dns_irsa_role.aws_iam_policy.external_dns[0] will be updated in-place
  ~ resource "aws_iam_policy" "external_dns" {
        id          = "arn:aws:iam::478282223251:policy/AmazonEKS_External_DNS_Policy-20240124130418960500000018"
        name        = "AmazonEKS_External_DNS_Policy-20240124130418960500000018"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z03891131G981LPL0YNZ0"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.external_dns_irsa_role.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::478282223251:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7988774709B9B56A046BA665D3B6EEBD"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "external-dns"
        name                  = "external-dns"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @eevlogiev, Action: `pull_request`*